system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        // Mandatory entries
        type            wallShearStress;
        libs            (fieldFunctionObjects);

        // Optional entries
        patches         (movingWall fixedWalls);
        writeFields     yes;

        // Optional (inherited) entries
        writePrecision  10;
        writeControl    writeTime;
        writeInterval   -1;
    }

    oscillatoryShearIndex1
    {
        // Mandatory entries
        type            oscillatoryShearIndex;
        libs            (oscillatoryShearIndex);

        // Optional entries
        patches         (movingWall fixedWalls);
        writeFields     yes;

        // Optional (inherited) entries
        writePrecision  10;
        writeControl    writeTime;
        writeInterval   -1;
    }        
}

// ************************************************************************* //
